{
  "backend/main.mo": "Main Motoko actor implementing a golf social dating app backend with user profiles, course directory with member sets, events with RSVPs, messaging system, and authorization/blob-storage mixins; includes queries and mutations for profile management, course membership, event creation, and messaging.",
  "feature_evidence.json": "Feature evidence report documenting four messaging-related features (REQ-49 through REQ-52) that add 'Message' buttons to CourseDirectory, ProfileDetailPage, and MapView pages, plus ChatPage auto-conversation opening functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with routing, hooks for backend queries, Layout with navigation, profile setup, and various pages (LandingPage, MapView, CourseDirectory, ChatPage, etc.) with their specific UI features and limitations.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "Basic HTML entry point with UTF-8 charset, viewport meta tag, app title 'Golf Social Dating App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup with root, landing, sign-up, and protected routes (map, courses, profile detail, sponsors, events, chat); includes authentication checks, profile setup flow, and ThemeProvider wrapper with Toaster.",
  "frontend/src/components/DropdownNavigation.tsx": "Dropdown menu component with navigation links to Map View, Course Directory, Course Booking, Events, Chat, and Sponsors pages, styled with courseGreen theme and lucide-react icons.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, logo, and route-based menu items (Map, Courses, Events, Chat, Sponsors) with active state highlighting and logout functionality. Includes responsive design with dropdown navigation for mobile and gradient background styling.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component for new users to enter golf-related information including age, handicap, gender, preferences, bio, home course, and location coordinates. Submits data via useSaveCallerUserProfile mutation and displays success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating an authenticated or anonymous actor based on identity state and initializing access control with admin token. Invalidates and refetches dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle. Provides login, clear, and status tracking functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, matches, courses, events, messages, and sponsors. Provides both query hooks for fetching data and mutation hooks for creating/updating resources with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom golf-themed color palette (fairway green, course green, grass green, sand tan, earth brown) defined as CSS variables for both light and dark modes. Includes base styling for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that displays a list of matched users and allows real-time messaging with selected users, including avatar display, message history, and sessionStorage-based conversation pre-selection.",
  "frontend/src/pages/CourseBooking.tsx": "Tee time booking page with search and filter functionality (date, time slot, number of players, distance) for browsing and booking golf course reservations.",
  "frontend/src/pages/CourseDirectory.tsx": "Golf course directory page with search and location filtering, displaying courses with expandable details showing member lists and enabling navigation to chat with members.",
  "frontend/src/pages/EventsPage.tsx": "Events management page that displays upcoming and past golf events, allows users to create new events and RSVP/cancel RSVPs to existing events.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature highlights, and authentication buttons (Get Started/Sign In) using Internet Identity integration.",
  "frontend/src/pages/MapView.tsx": "Displays a filterable list of golf matches with distance calculations, handicap range, and preference filters. Users can view profiles, send messages, or navigate to detailed profile pages.",
  "frontend/src/pages/ProfileDetailPage.tsx": "Shows detailed profile information for a specific user including avatar, bio, handicap, gender, preferences, and location. Provides navigation back to directory and messaging functionality.",
  "frontend/src/pages/SignUpPage.tsx": "User registration form collecting profile data including age, handicap, gender, preferences, bio, location coordinates, home course, and profile photo with validation and Internet Identity authentication.",
  "frontend/src/pages/SponsorsPage.tsx": "Displays a grid of sponsor cards with mock details including name, category, description, and website links. Shows placeholder content when no sponsors are available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom golf-themed color palette (fairwayGreen, courseGreen, etc.), extended design tokens using OKLCH color space, and animation plugins.",
  "project_state.json": "Project state file tracking a golf social dating app with 19 versions, documenting existing features like location-based maps, course booking, chat system, and user profiles. Contains architectural notes about authentication, real-time messaging, and external integrations, plus known issues with post-login navigation."
}