{
  "backend/main.mo": "Main Motoko actor implementing a golf social dating app with user profiles (including age, handicap, gender, location, bio, photos), course directory, events with RSVPs, messaging, sponsors, match searching, and role-based access control using authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades OldUserProfile to NewUserProfile by adding age, homeCourse, and profilePhoto fields with default values (0, empty string, null) while preserving existing profile data.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including SignUpPage navigation, form fields (age, handicap, gender, seeking preference, bio, home course, location, profile photo), authentication flow, and profile management with high confidence test coverage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, authentication, profile management, map view with golfer cards, course directory/booking, sponsors, events, chat functionality, and styling with golf-themed colors.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark mode color schemes using OKLCH color space for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'Golf Social Dating App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "React app with TanStack Router defining routes for landing, sign-up, and protected pages (map, courses, sponsors, events, chat), authentication checks, profile setup flow, and theme provider with toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation (Discover, Courses, Events, Chat, Sponsors), logo, logout button, and footer. Uses TanStack Router for navigation and highlights active routes.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component for new users to enter age, handicap, gender, preferences, bio, home course, and location. Submits data via useSaveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity storage, and providing login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, matches, courses, sponsors, events (create/RSVP/cancel), and messages with 3-second polling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom golf-themed color palette (fairway green, sand tan, grass green) for both light and dark modes, plus base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that displays a list of matches and allows users to send/receive messages with selected matches, including avatar display and real-time message updates.",
  "frontend/src/pages/CourseBooking.tsx": "Tee time booking page with search filters for date, time slot, number of players, and distance to find and book available golf course tee times.",
  "frontend/src/pages/CourseDirectory.tsx": "Golf course directory page that displays a searchable and filterable list of courses with details like location, allowing users to browse and navigate to course details.",
  "frontend/src/pages/EventsPage.tsx": "Golf events page where users can view upcoming/past events, create new events, and RSVP to events with real-time attendee tracking.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature highlights, and authentication buttons to onboard new users to the golf dating/networking platform.",
  "frontend/src/pages/MapView.tsx": "Displays a filterable map view of potential golf matches with distance calculations, handicap/preference filters, and profile cards showing user details, avatars, and action buttons for viewing profiles or messaging.",
  "frontend/src/pages/SignUpPage.tsx": "User registration form collecting profile data including age, handicap, gender, preferences, bio, location coordinates, home course, and profile photo upload with validation and Internet Identity authentication.",
  "frontend/src/pages/SponsorsPage.tsx": "Displays a grid of sponsor cards with placeholder images, categories, descriptions, and external website links fetched from backend sponsor data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom golf-themed colors (fairway green, course green, sand tan), extended design tokens using OKLCH color space, and animation keyframes for UI components.",
  "project_state.json": "Project metadata tracking the golf social dating app's architecture, features, requirements, and known issues including location-based matching, course booking, chat, and profile management."
}