{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add user messaging functionality for course members to connect",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Add 'Message' button to member profile cards in CourseDirectory that initiates conversations",
      "acceptanceCriteria": [
        "Each member profile card in the CourseDirectory displays a 'Message' button",
        "Clicking the 'Message' button navigates to the ChatPage with that member's conversation pre-selected",
        "Button is styled consistently with the golf theme using courseGreen or fairwayGreen colors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CourseDirectory.tsx",
          "operation": "modify",
          "description": "Add a 'Message' button to each member profile card within the expandable course sections. The button should be styled with courseGreen/fairwayGreen colors and positioned alongside existing profile actions. On click, navigate to ChatPage using the member's Principal as navigation state to pre-select their conversation. Use the useNavigate hook from TanStack Router to pass the target user Principal."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Add 'Message' button to ProfileDetailPage for initiating conversations with profile owners",
      "acceptanceCriteria": [
        "ProfileDetailPage displays a prominent 'Message' button below or alongside the profile information",
        "Clicking the button navigates to the ChatPage with the profile owner's conversation active",
        "Button is disabled if viewing own profile with appropriate visual feedback"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileDetailPage.tsx",
          "operation": "modify",
          "description": "Add a 'Message' button prominently positioned below the profile information section. Use the authorization component's identity comparison to disable the button when viewing your own profile (compare current user's Principal with the profile owner's Principal). Style the button with golf theme colors (courseGreen) and show disabled state with opacity and a cursor style. On click, navigate to ChatPage with the profile owner's Principal passed as navigation state."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Add 'Message' button to match profile cards in MapView for initiating conversations",
      "acceptanceCriteria": [
        "Each match profile card displays a 'Message' button alongside the 'View Profile' button",
        "Clicking the button navigates to the ChatPage with that user's conversation pre-selected",
        "Button styling is consistent with other messaging entry points across the app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MapView.tsx",
          "operation": "modify",
          "description": "Add a 'Message' button to each match profile card, positioned alongside the existing 'View Profile' button. Style consistently with other messaging entry points using courseGreen/fairwayGreen colors. On click, navigate to ChatPage with the matched user's Principal passed as navigation state to pre-select their conversation thread."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Update ChatPage to automatically open conversations when navigated with a target user Principal",
      "acceptanceCriteria": [
        "ChatPage accepts a target user Principal ID via route navigation state or URL parameter",
        "If a conversation with the target user exists, it is automatically selected and displayed",
        "If no conversation exists, a new empty conversation thread is displayed with the target user",
        "Message input field is focused and ready for the user to compose their first message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Update ChatPage to accept a target user Principal via route navigation state (check location.state from TanStack Router). On component mount or when the target Principal changes, check if a conversation with that user exists in the matches list. If found, automatically select it and display the message thread. If not found, initialize a new empty conversation view showing the target user's profile information with an empty message list. Focus the message input field using useEffect and a ref. Ensure the auto-selection logic runs after matches data is loaded to avoid race conditions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the ChatPage route definition to accept navigation state containing a target user Principal. Ensure the route properly passes location state to the ChatPage component so it can access the target Principal for auto-conversation selection."
        }
      ]
    }
  ]
}